# vsoAppendParamWidget

## Description
Sets a widget to appear at the end of the widgets in the Object Info Palette.

```pascal
FUNCTION vsoAppendParamWidget(
				parameterID : LONGINT;
				text        : STRING;
				data        : LONGINT) : BOOLEAN;
```

```python

def vs.vsoAppendParamWidget(parameterID, text, data):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|parameterID|LONGINT||
|text|STRING||
|data|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events